// //////////////////////////////////////////////////////////////////////////////////////
//
//    Copyright 2023 James Patrick Norris
//
//    This file is part of DiaperGlu v5.11.
//
//    DiaperGlu v5.11 is free software; you can redistribute it and/or modify
//    it under the terms of the GNU General Public License as published by
//    the Free Software Foundation; either version 2 of the License, or
//    (at your option) any later version.
//
//    DiaperGlu v5.11 is distributed in the hope that it will be useful,
//    but WITHOUT ANY WARRANTY; without even the implied warranty of
//    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//    GNU General Public License for more details.
//
//    You should have received a copy of the GNU General Public License
//    along with DiaperGlu v5.11; if not, write to the Free Software
//    Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
//
// //////////////////////////////////////////////////////////////////////////////////////

// /////////////////////////////
// James Patrick Norris       //
// www.rainbarrel.com         //
// June 10, 2023              //
// version 5.11               //
// /////////////////////////////

#include <sys/mman.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/time.h>
#include <errno.h>
#include <fcntl.h>
#include <dlfcn.h>
// #include <pthread.h>
//#include <elf.h>

#include <termios.h>

const char dg_invalidparametererror[] = " - invalid parameter error";
const char dg_notexecutablefileerror[] = " - not an executable file error";
const char dg_parametersovermaxsizeerror[] = " - parameter list's size over system size limit error";
const char dg_ioerror[] = " - input or output error";
const char dg_toomanysymboliclinkserror[] = " - path to file has too many symbolic links error.";
const char dg_pathorfilenametoolongerror[] = " - path or file name too long error";
const char dg_partofpathnotdirectoryerror[] = " - part of the path does not point to a directory error";
const char dg_fileopenforwriteerror[] = " - file open for write error";
const char dg_badprocessiderror[] = " - process does not exist or is not a child of the calling process";
const char dg_interruptedbysignalerror[] = " - call was interrupted and not restarted error";
const char dg_toomanyprocesseserror[] = " - too many processes error";
const char dg_freemutexwhilelockederror[] = " - can't free a mutex while it is locked error";
const char dg_woulddeadlockerror[] = " - waiting for mutex will cause a deadlock error";
const char dg_mutexisnotlockederror[] = " - mutex is not locked error";

// const char dg_writeprotectederror[]        = " - write protected error";
const char dg_diskisfullerror[] = " - disk is full error";
const char dg_invaliduserbuffererror[] = " - invalid user buffer error, probably means too many pending i/o requests - os couldn't keep up and ran out of buffers";
const char dg_unknownwriteerror[] = " - unknown write error";
const char dg_couldnotgetpagelockerror[] = " - os could not get page lock on the caller's memory buffer error";

const char dg_segmentgoespastenderror[] = "- offset + length goes past end of buffer error";

const char dg_badmagicerror[] = " - file or structure's magic number not what was expected error";
const char dg_missingexporttableerror[] = " - library file's export table is missing error";
const char dg_exporttablebounderror[] = " - library file export table's declared size goes into something else's memory error";


const char dg_scanforbytename[] = "dg_scanforbyte";
const char dg_comparebytesname[] = "dg_comparebytes";
const char dg_getuint64name[] = "dg_getuint64";
// const char dg_hctwostorename[] = "dg_hctwostore";


// From the handle returned from dlopen which is of type ImageLoaderMachO (and is a class)
// I need fDynamicInfo and fSymbols, these are pointers..... soo
//  if I find out the offsets of these pointers in the ImageLoaderMachO structure, 
//  I should be able to kick butt

// ///////////////////////
// Note to self:
//   To make this api the same on all platforms, need to standardize the value
//   of a bad buffer handle. I read somewhere that NULL is a valid buffer address
//   in Linux, but now the man page I'm reading says mmap will never return 0 
//   for an address. In any case I'm going to make -1 the bad buffer handle value
//   from this api's point of view. 
// ///////////////////////


// struct relocation_info {
//    int32_t    r_address;    /* offset in the section to what is being
//                    relocated */
//    uint32_t     r_symbolnum:24,    /* symbol index if r_extern == 1 or section
//                    ordinal if r_extern == 0 */
//         r_pcrel:1,     /* was relocated pc relative already */
//         r_length:2,    /* 0=byte, 1=word, 2=long, 3=quad */
//         r_extern:1,    /* does not include value of sym referenced */
//         r_type:4;    /* if not 0, machine specific relocation type */
// };


/*
struct dg_macosx_dylibhandle;

struct dg_dependentLibrary {
    struct dg_macosx_dylibhandle*	pimage;
	UINT32	required : 1,
            checksumMatches : 1,
            isReExported : 1,
            isSubFramework : 1;
};
        
struct dg_macosx_dylibhandle {
    //UINT32 (**imp)()                       pVtable pointer; // 00
    Class                                   *isa; // 00  This is not it....
    const char*                             pPath;  // 04
    const char*                             pLogicalPath; // 08
    dev_t                                   device; // 0C
	ino_t                                   inode; // 10
	time_t                                  lastModified; // 18
	UINT64                                  offsetInFatFile; // 1C
	struct dg_dependentLibrary*             pLibraries; // 24
	UINT32                                  librariesCount; // 28
	UINT32                                  pathHash; // 2C
	UINT32                                  dlopenReferenceCount;	// 30 // count of how many dlopens have been done on this image
	UINT32                                  staticReferenceCount;	// 34 // count of images that have a fLibraries entry pointing to this image
	UINT32                                  dynamicReferenceCount;	// 38 // count of images that have a fDynamicReferences entry pointer to this image
	struct dg_macosx_dylibhandle*           pDynamicReferences;     // 3C
    UINT32                                  depthLoadOrder; // 40
    UINT32                                  flags; // 44
    UINT32                                  initializerLocak; // 48
    const struct mach_header*               pMachHeader; // 4C
	const unsigned char*                    pLinkEditBase; // add any internal "offset" to this to get actual address
	const unsigned char*                    pSymbolTable; // this can be either array of NLIST or NLIST64
	const unsigned char*                    pStringTable;
	const struct dysymtab_command*          pDynamicInfo;
	UINT32                                  slide; // might be 64
	const struct twolevel_hints_command*	pTwoLevelHints;
	const struct dylib_command*				pDylibID;
	//class SegmentMachO*						fSegmentsArray;
	//class SegmentMachO*						fReadOnlyImportSegment; // NULL unless __IMPORT segment built with -read_only_stubs
	//static uint32_t							fgReadOnlyImportSpinLock;
};
*/

// I think the length of this structure is probably 0x68
// struct dg_macosx10_6_8_dylibhandle {
    //dg_macosx10_6_8_dylibvtable             *pVtable;               // 00  This is probably it....
